TBL_RPF/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (272 0 0);

boundaryField
{
    my-velocity-inlet
    {
        type            fixedValue;
        value           uniform (272 0 0);
    }

    my-pressure-outlet
    {
       type            zeroGradient;
//       value           uniform (272 0 0);
//       field           U;                
//       gamma           1.4;              
//       phi             phi;           
//       rho             rho;              
//       psi             thermo:psi;   
//       lInf            5;           
//       fieldInf        (272 0 0);
    }

    my-wall
    {
        type            fixedValue;
	value		uniform (0 0 0);
    }

    "(backPlanes|frontPlanes)" 
    {
        type            empty;
    }

    symm
    {
        type            symmetry;
    }

    freeSurf
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
