TBL_RPF/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform  101325;

boundaryField
{

    my-velocity-inlet
    {
       type            zeroGradient; 
    }

    my-pressure-outlet
    {
       type            fixedValue;
	value		uniform	101325;
//       value           uniform 101325;
//       field           p;             
//       gamma           1.4;           
//       phi             phi;          
//       rho             rho;           
//       psi             thermo:psi;  
//       lInf            5;             
//       fieldInf        101325;        
    }
    
    my-wall
    {
       type            zeroGradient;
    }

    "(backPlanes|frontPlanes)"
    {
       type            empty;
    }
   
    symm
    {
       type            symmetry;
    }

    freeSurf
    {
       type            zeroGradient;
    }
}

// ************************************************************************* //
