TBL_RPF/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];


internalField   uniform (0 0 0);

boundaryField
{
    my-velocity-inlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    my-pressure-outlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    symm
    {
        type            symmetry;
    }
    my-wall
    {
        type            calculated;
        value           nonuniform List<vector> 
256
(
(-7153.39999006 0 0)
(-7153.39999006 0 0)
(-7153.39999006 0 0)
(-7153.39999006 0 0)
(-7153.39999006 0 0)
(-7153.39999006 0 0)
(-7153.39999006 0 0)
(-7153.39999006 0 0)
...
)
;
    }
    backPlanes
    {
        type            empty;
    }
    frontPlanes
    {
        type            empty;
    }
    freeSurf
    {
        type            calculated;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
