TBL_RPF/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   uniform 0;

boundaryField
{
    my-velocity-inlet
    {
        type            calculated;
        value           uniform 0;
    }
    my-pressure-outlet
    {
        type            calculated;
        value           uniform 0;
    }
    symm
    {
        type            symmetry;
    }
    my-wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
256
(
3.55636514999
3.55636514999
3.55636514999
3.55636514999
3.55636514999
3.55636514999
3.55636514999
3.55636514999
...
)
;
    }
    backPlanes
    {
        type            empty;
    }
    frontPlanes
    {
        type            empty;
    }
    freeSurf
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
