TBL_RPF/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application             rhoPimpleFoam;

startFrom               latestTime;

startTime               0;

stopAt                  endTime;

endTime                 1;

deltaT                  2e-10;

writeControl            adjustableRunTime;

writeInterval           1e-3;

purgeWrite              10;

writeFormat             ascii;

writePrecision          6;

writeCompression        off;

timeFormat              general;

timePrecision           6;

runTimeModifiable       true;

adjustTimeStep          yes;

maxCo                   0.5;


functions
{
    #include "forces"
}


// ************************************************************************* //
